cfe/ConfluenceCloud1C/DataProcessors/confluence_БазаЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>confluence_БазаЗнаний</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьВнешниеСсылкиВ1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРаздела</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытьПолеВводаРаздела</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cfe/ConfluenceCloud1C/DataProcessors/confluence_БазаЗнаний/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаписатьНастройкиВХранилище(знач Настройки) Экспорт
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("Обработки.confluence_БазаЗнаний",
		"ЗначенияРеквизитов",
		Настройки,
		НСтр("ru='Значения реквизитов формы для заполнения.'")); 
	
КонецПроцедуры
	
Функция ПолучитьНастройкиИзХранилища() Экспорт
	
	Возврат ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("Обработки.confluence_БазаЗнаний",
		"ЗначенияРеквизитов",
		СтруктураНастроек());
	
КонецФункции

Функция СтруктураНастроек() Экспорт
	Структура = Новый Структура;
	Структура.Вставить("АдресСервера"				, "");
	Структура.Вставить("ОткрыватьВнешниеСсылкиВ1С"	, Ложь);
	Структура.Вставить("ИдентификаторРаздела"		, "");
	Структура.Вставить("СкрытьПолеВводаРаздела"		, Ложь);
	
	Возврат Структура;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий
#КонецОбласти

#Область ОбновлениеИнформационнойБазы
#КонецОбласти

#Область ИнтернетСервис
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти

#Область Печать
#КонецОбласти

#КонецЕсли
